leveldb_writergroup.org
#+TITLE: 给Leveldb添加WriteCallback
#+SETUPFILE: ./latexcss/latexcss.theme
#+OPTIONS: ^:nil
#+INCLUDE: back.org

* Introduction
最近，在leveldb的基础上实现键值分离，提高小key大value下的写性能，后续会专门写几篇post介绍实现原理。

其中，我们在对ValueLog进行垃圾回收时，(1)先将依然有效的value写到新的ValueLog中，然后需要(2)将这些value新的位置<key, vptr>批量写回LSMTree。

这其中存在一个问题：如果在我们完成了(1)，这时用户做了update，(2)就会将用户的update给覆盖，导致不一致。

我们肯定不能在GC的时候将整个DB锁住，因为GC太耗费时间了。做法是，整个GC过程不加锁，在(2)最终写入WAL和LSM之前，最后检查一下将要写回的<key, vptr>，是否被用户覆盖。因为这时我们已经在DBImpl::Write内部了，且leveldb同时只有一个writer可以执行，只要最终检查通过，我们就可以写回。

流程就是：
1. 选取某个VLOG
2. 遍历VLOG中的<K,V>，回查LSMTree，将有效的<K, V>放入buffer，无效的丢弃。
3. 将buffer写入新的VLOG，与此同时获得了这些有效的<K,V>的新位置vptr
4. 将<K, vptr>写入LSMTree（DBImpl::Write()：
   - 获得锁
   - 再次通过DBImpl::Get回查
   - 回查有效，继续写入WAL和MemTable；回查失败，直接返回

* 为什么需要Callback
从上面的流程可以看到，我们需要在DBImpl内部，写WAL和MemTable前执行我们的回查逻辑。因此我们需要一种Callback机制。Callback返回Status，如果ok，继续写入，否则返回。

其实RocksDB就有很多Callback，不仅在写WAL前有，在写完WAL和写MemTable前也有，写完MemTable也有Callback，做Flush之前也有Callback。

但我们不需要那么多且复杂的Callback。

* Callback带来的问题
leveldb在Write中，会将多个writer的WriteBatch组合成BatchGroup，由当前获得写入权的writer批量写入，然后再通知被阻塞的writer写入完成。

但加入了WriteCallback，我们就没法简单地将不同writer的WriteBatch做grouping了。

一个writer的WriteBatch和WriteCallback是绑定的。它的callback执行结果仅代表它的batch能否被写入。对于指定了callback的writer，它们的batch是不能做grouping的。

1. 对于没有指定callback的writer，它们之间可以做batch grouping
2. 对于指定了callback的writer，它需要单独调用callback和写入batch

这就意味着，我们GC时回写<k, vptr>没法batch，只能一个一个callback去查再写。每次我们都要加锁解锁，降低吞吐量。

为此我们需要改造一些grouping的形式，比起batch group，我们需要writer group。

#+begin_src cpp
  class LEVELDB_EXPORT WriteCallback {
   public:
    virtual ~WriteCallback(){};

    virtual Status Callback(DB* db) = 0;

    // allow writer grouping
    virtual bool AllowGrouping() const { return false; }
  };
#+end_src

