leveldb_writergroup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-13 Thu 20:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>给Leveldb添加WriteCallback</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">给Leveldb添加WriteCallback</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7b84723">1. Introduction</a></li>
<li><a href="#org6cb5bd8">2. 为什么需要Callback</a></li>
<li><a href="#org042e274">3. Callback带来的问题</a></li>
<li><a href="#orgc4f54b6">4. WriterGroup</a>
<ul>
<li><a href="#org61574f1">4.1. 修改后的写入流程</a></li>
<li><a href="#orgcc7f425">4.2. Example usage</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>

<div id="outline-container-org7b84723" class="outline-2">
<h2 id="org7b84723"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
最近，在leveldb的基础上实现键值分离，提高小key大value下的写性能，后续会专门写几篇post介绍实现原理。
</p>

<p>
其中，我们在对ValueLog进行垃圾回收时，(1)先将依然有效的value写到新的ValueLog中，然后需要(2)将这些value新的位置&lt;key, vptr&gt;批量写回LSMTree。
</p>

<p>
这其中存在一个问题：如果在我们完成了(1)，这时用户做了update，(2)就会将用户的update给覆盖，导致不一致。
</p>

<p>
我们肯定不能在GC的时候将整个DB锁住，因为GC太耗费时间了。做法是，整个GC过程不加锁，在(2)最终写入WAL和LSM之前，最后检查一下将要写回的&lt;key, vptr&gt;，是否被用户覆盖。因为这时我们已经在DBImpl::Write内部了，且leveldb同时只有一个writer可以执行，只要最终检查通过，我们就可以写回。
</p>

<p>
流程就是：
</p>
<ol class="org-ol">
<li>选取某个VLOG</li>
<li>遍历VLOG中的&lt;K,V&gt;，回查LSMTree，将有效的&lt;K, V&gt;放入buffer，无效的丢弃。</li>
<li>将buffer写入新的VLOG，与此同时获得了这些有效的&lt;K,V&gt;的新位置vptr</li>
<li>将&lt;K, vptr&gt;写入LSMTree（DBImpl::Write()：
<ul class="org-ul">
<li>获得锁</li>
<li>再次通过DBImpl::Get回查</li>
<li>回查有效，继续写入WAL和MemTable；回查失败，直接返回</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org6cb5bd8" class="outline-2">
<h2 id="org6cb5bd8"><span class="section-number-2">2.</span> 为什么需要Callback</h2>
<div class="outline-text-2" id="text-2">
<p>
从上面的流程可以看到，我们需要在DBImpl内部，写WAL和MemTable前执行我们的回查逻辑。因此我们需要一种Callback机制。Callback返回Status，如果ok，继续写入，否则返回。
</p>

<p>
其实RocksDB就有很多Callback，不仅在写WAL前有，在写完WAL和写MemTable前也有，写完MemTable也有Callback，做Flush之前也有Callback。
</p>

<p>
但我们不需要那么多且复杂的Callback。
</p>
</div>
</div>

<div id="outline-container-org042e274" class="outline-2">
<h2 id="org042e274"><span class="section-number-2">3.</span> Callback带来的问题</h2>
<div class="outline-text-2" id="text-3">
<p>
leveldb在Write中，会将多个writer的WriteBatch组合成BatchGroup，由当前获得写入权的writer批量写入，然后再通知被阻塞的writer写入完成。
</p>

<p>
但加入了WriteCallback，我们就没法简单地将不同writer的WriteBatch做grouping了。
</p>

<p>
一个writer的WriteBatch和WriteCallback是绑定的。它的callback执行结果仅代表它的batch能否被写入。对于指定了callback的writer，它们的batch是不能做grouping的。
</p>

<ol class="org-ol">
<li>对于没有指定callback的writer，它们之间可以做batch grouping</li>
<li>对于指定了callback的writer，它需要单独调用callback和写入batch</li>
</ol>

<p>
这就意味着，我们GC时回写&lt;k, vptr&gt;没法batch，只能一个一个callback去查再写。每次我们都要加锁解锁，降低吞吐量。
</p>

<p>
为此我们需要改造一些grouping的形式，比起batch group，我们需要writer group。
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000cd;">class</span> <span style="color: #228b22;">LEVELDB_EXPORT</span> <span style="color: #228b22;">WriteCallback</span> {
 <span style="color: #0000cd;">public</span>:
  <span style="color: #0000cd;">virtual</span> ~<span style="color: #ff0000;">WriteCallback</span>(){};

  <span style="color: #0000cd;">virtual</span> <span style="color: #228b22;">Status</span> <span style="color: #ff0000;">Callback</span>(<span style="color: #228b22;">DB</span>* <span style="color: #a0522d;">db</span>) = 0;

  <span style="color: #b22222;">// </span><span style="color: #b22222;">allow writer grouping</span>
  <span style="color: #0000cd;">virtual</span> <span style="color: #228b22;">bool</span> <span style="color: #ff0000;">AllowGrouping</span>() <span style="color: #0000cd;">const</span> { <span style="color: #0000cd;">return</span> <span style="color: #00006DE06DE0;">false</span>; }
};
</pre>
</div>
</div>
</div>
