leveldb_writergroup.org
* WriterGroup

有了WriteCallback，我们不能简单地group batch，但我们依然可以让当前writer代理等待中的writer进行写入。

WriterGroup的设计：
1. 一次DBImpl::Write写入一个WriterGroup
2. 一个WriterGroup包含多个batch group
3. WriterGroup包含多个leader，leader是batch group的第一个writer
4. 第一个leader称为first leader，它就是当前取得了写入权的writer
5. 写入WAL和MemTable的基本单位就是batch group

Group的原则：
1. 有callback的writer单独成一个batch group，自己是leader。
2. 连续的多个无callback的writer成一个batch group，第一个writer是leader。该batch group的其它writer的batch被append到leader的batch中。
3. 无batch（batch==nullptr）的writer单独成batch group，自己是leader。
4. writer group的总batch size大于预设，停止构造； 或已经包含了等待队列writers_中的所有writer
5. 所有leader串成链表

WriterGroup:
#+begin_src cpp
  // Information kept for every waiting writer
  /*
   * db->writers_: [w0|w1|w2|w3|w4|w5|w6|..|..]
   *
   * After BuildWriterGroup:
   *  [ w0 |w1|w2|  w3  |w4|w5|w6|w7|w8]
   *    |          ↑ |            ↑
   *    |  w0.next | |   w3.next  |
   *    |__________| |____________|
   *
   * w0.batch also holds the contents of w1.batch and w2.batch
   * w3.batch holds the contents of w3-w6.batch
   *
   * w0 and w3 are called leaders.
   * w0 is the first leader of the WriteGroup.
   */
  struct DBImpl::Writer {
    explicit Writer(port::Mutex* mu)
        : batch(nullptr),
          callback(nullptr),
          sync(false),
          done(false),
          next(nullptr),
          cv(mu) {}

    Status status;
    WriteBatch* batch;
    WriteCallback* callback;
    Writer* next;
    bool sync;
    bool done;
    port::CondVar cv;
  };

  struct DBImpl::WriterGroup {
    WriterGroup() : first_leader(nullptr), last_writer(nullptr) {}
    Writer* first_leader;
    Writer* last_writer;
  };
#+end_src
   
我们用BuildWriterGroup替代原来的BuildBatchGroup：
#+begin_src cpp
  void DBImpl::BuildWriterGroup(WriterGroup* group) {
    mutex_.AssertHeld();
    assert(!writers_.empty());
    Writer* cur_leader = writers_.front();
    Writer* prev_leader = nullptr;
    group->first_leader = cur_leader;
    bool sync = cur_leader->sync;
    assert(cur_leader->batch != nullptr);

    size_t size = WriteBatchInternal::ByteSize(cur_leader->batch);

    // Allow the group to grow up to a maximum size, but if the
    // original write is small, limit the growth so we do not slow
    // down the small write too much.
    size_t max_size = 1 << 20;
    if (size <= (128 << 10)) {
      max_size = size + (128 << 10);
    }

    group->last_writer = cur_leader;
    if (cur_leader->callback && !cur_leader->callback->AllowGrouping()) {
      return;
    }
    bool prev_have_callback = (cur_leader->callback != nullptr);
    std::deque<Writer*>::iterator iter = writers_.begin();
    ++iter;  // Advance past "first"
    for (; iter != writers_.end(); ++iter) {
      Writer* w = *iter;

      if (w->sync && !sync) {
        // Do not include a sync write into a batch handled by a non-sync write.
        break;
      }

      if (w->callback && !w->callback->AllowGrouping()) {
        break;
      }

      if (w->callback != nullptr || prev_have_callback) {
        /*
         ,* w has callback OR
         ,* w has no callback but prev writer has callback.
         ,*
         ,* We need to switch to a new leader.
         ,*/
        prev_leader = cur_leader;
        cur_leader->next = w;
        cur_leader = w;
        prev_have_callback = (w->callback != nullptr);
      }

      if (w->batch != nullptr) {
        size += WriteBatchInternal::ByteSize(w->batch);
        if (size > max_size) {
          // Do not make batch too big
          if (cur_leader == w) {
            // we just switched to a new leader, but the new leader
            // will not be included in the writer group.
            prev_leader->next = nullptr;
          }
          break;
        }

        if (cur_leader->batch == nullptr) {
          cur_leader->next = w;
          cur_leader = w;
        }

        if (w != cur_leader) {
          WriteBatchInternal::Append(cur_leader->batch, w->batch);
        }
      }
      group->last_writer = w;
    }
  }
#+end_src

