leveldb_writergroup.html

<div id="outline-container-orgc4f54b6" class="outline-2">
<h2 id="orgc4f54b6"><span class="section-number-2">4.</span> WriterGroup</h2>
<div class="outline-text-2" id="text-4">
<p>
有了WriteCallback，我们不能简单地group batch，但我们依然可以让当前writer代理等待中的writer进行写入。
</p>

<p>
WriterGroup的设计：
</p>
<ol class="org-ol">
<li>一次DBImpl::Write写入一个WriterGroup</li>
<li>一个WriterGroup包含多个batch group</li>
<li>WriterGroup包含多个leader，leader是batch group的第一个writer</li>
<li>第一个leader称为first leader，它就是当前取得了写入权的writer</li>
<li>写入WAL和MemTable的基本单位就是batch group</li>
</ol>

<p>
Group的原则：
</p>
<ol class="org-ol">
<li>有callback的writer单独成一个batch group，自己是leader。</li>
<li>连续的多个无callback的writer成一个batch group，第一个writer是leader。该batch group的其它writer的batch被append到leader的batch中。</li>
<li>无batch（batch==nullptr）的writer单独成batch group，自己是leader。</li>
<li>writer group的总batch size大于预设，停止构造； 或已经包含了等待队列writers_中的所有writer</li>
<li>所有leader串成链表</li>
</ol>

<p>
WriterGroup:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #b22222;">// </span><span style="color: #b22222;">Information kept for every waiting writer</span>
<span style="color: #b22222;">/*</span>
<span style="color: #b22222;"> * db-&gt;writers_: [w0|w1|w2|w3|w4|w5|w6|..|..]</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> * After BuildWriterGroup:</span>
<span style="color: #b22222;"> *  [ w0 |w1|w2|  w3  |w4|w5|w6|w7|w8]</span>
<span style="color: #b22222;"> *    |          &#8593; |            &#8593;</span>
<span style="color: #b22222;"> *    |  w0.next | |   w3.next  |</span>
<span style="color: #b22222;"> *    |__________| |____________|</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> * w0.batch also holds the contents of w1.batch and w2.batch</span>
<span style="color: #b22222;"> * w3.batch holds the contents of w3-w6.batch</span>
<span style="color: #b22222;"> *</span>
<span style="color: #b22222;"> * w0 and w3 are called leaders.</span>
<span style="color: #b22222;"> * w0 is the first leader of the WriteGroup.</span>
<span style="color: #b22222;"> */</span>
<span style="color: #0000cd;">struct</span> <span style="color: #00006DE06DE0;">DBImpl</span>::<span style="color: #228b22;">Writer</span> {
  <span style="color: #0000cd;">explicit</span> <span style="color: #ff0000;">Writer</span>(<span style="color: #00006DE06DE0;">port</span>::<span style="color: #228b22;">Mutex</span>* <span style="color: #a0522d;">mu</span>)
      : batch(<span style="color: #00006DE06DE0;">nullptr</span>),
        callback(<span style="color: #00006DE06DE0;">nullptr</span>),
        sync(<span style="color: #00006DE06DE0;">false</span>),
        done(<span style="color: #00006DE06DE0;">false</span>),
        next(<span style="color: #00006DE06DE0;">nullptr</span>),
        cv(mu) {}

  <span style="color: #228b22;">Status</span> <span style="color: #a0522d;">status</span>;
  <span style="color: #228b22;">WriteBatch</span>* <span style="color: #a0522d;">batch</span>;
  <span style="color: #228b22;">WriteCallback</span>* <span style="color: #a0522d;">callback</span>;
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">next</span>;
  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">sync</span>;
  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">done</span>;
  <span style="color: #00006DE06DE0;">port</span>::<span style="color: #228b22;">CondVar</span> <span style="color: #a0522d;">cv</span>;
};

<span style="color: #0000cd;">struct</span> <span style="color: #00006DE06DE0;">DBImpl</span>::<span style="color: #228b22;">WriterGroup</span> {
  <span style="color: #ff0000;">WriterGroup</span>() : first_leader(<span style="color: #00006DE06DE0;">nullptr</span>), last_writer(<span style="color: #00006DE06DE0;">nullptr</span>) {}
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">first_leader</span>;
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">last_writer</span>;
};
</pre>
</div>

<p>
我们用BuildWriterGroup替代原来的BuildBatchGroup：
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #228b22;">void</span> <span style="color: #00006DE06DE0;">DBImpl</span>::<span style="color: #ff0000;">BuildWriterGroup</span>(<span style="color: #228b22;">WriterGroup</span>* <span style="color: #a0522d;">group</span>) {
  mutex_.AssertHeld();
  assert(!writers_.empty());
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">cur_leader</span> = writers_.front();
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">prev_leader</span> = <span style="color: #00006DE06DE0;">nullptr</span>;
  group-&gt;first_leader = cur_leader;
  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">sync</span> = cur_leader-&gt;sync;
  assert(cur_leader-&gt;batch != <span style="color: #00006DE06DE0;">nullptr</span>);

  <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">size</span> = <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::ByteSize(cur_leader-&gt;batch);

  <span style="color: #b22222;">// </span><span style="color: #b22222;">Allow the group to grow up to a maximum size, but if the</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">original write is small, limit the growth so we do not slow</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">down the small write too much.</span>
  <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">max_size</span> = 1 &lt;&lt; 20;
  <span style="color: #0000cd;">if</span> (size &lt;= (128 &lt;&lt; 10)) {
    max_size = size + (128 &lt;&lt; 10);
  }

  group-&gt;last_writer = cur_leader;
  <span style="color: #0000cd;">if</span> (cur_leader-&gt;callback &amp;&amp; !cur_leader-&gt;callback-&gt;AllowGrouping()) {
    <span style="color: #0000cd;">return</span>;
  }
  <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">prev_have_callback</span> = (cur_leader-&gt;callback != <span style="color: #00006DE06DE0;">nullptr</span>);
  <span style="color: #00006DE06DE0;">std</span>::<span style="color: #00006DE06DE0;">deque</span>&lt;<span style="color: #228b22;">Writer</span>*&gt;::<span style="color: #228b22;">iterator</span> <span style="color: #a0522d;">iter</span> = writers_.begin();
  ++iter;  <span style="color: #b22222;">// </span><span style="color: #b22222;">Advance past "first"</span>
  <span style="color: #0000cd;">for</span> (; iter != writers_.end(); ++iter) {
    <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">w</span> = *iter;

    <span style="color: #0000cd;">if</span> (w-&gt;sync &amp;&amp; !sync) {
      <span style="color: #b22222;">// </span><span style="color: #b22222;">Do not include a sync write into a batch handled by a non-sync write.</span>
      <span style="color: #0000cd;">break</span>;
    }

    <span style="color: #0000cd;">if</span> (w-&gt;callback &amp;&amp; !w-&gt;callback-&gt;AllowGrouping()) {
      <span style="color: #0000cd;">break</span>;
    }

    <span style="color: #0000cd;">if</span> (w-&gt;callback != <span style="color: #00006DE06DE0;">nullptr</span> || prev_have_callback) {
      <span style="color: #b22222;">/*</span>
<span style="color: #b22222;">       * w has callback OR</span>
<span style="color: #b22222;">       * w has no callback but prev writer has callback.</span>
<span style="color: #b22222;">       *</span>
<span style="color: #b22222;">       * We need to switch to a new leader.</span>
<span style="color: #b22222;">       */</span>
      prev_leader = cur_leader;
      cur_leader-&gt;next = w;
      cur_leader = w;
      prev_have_callback = (w-&gt;callback != <span style="color: #00006DE06DE0;">nullptr</span>);
    }

    <span style="color: #0000cd;">if</span> (w-&gt;batch != <span style="color: #00006DE06DE0;">nullptr</span>) {
      size += <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::ByteSize(w-&gt;batch);
      <span style="color: #0000cd;">if</span> (size &gt; max_size) {
        <span style="color: #b22222;">// </span><span style="color: #b22222;">Do not make batch too big</span>
        <span style="color: #0000cd;">if</span> (cur_leader == w) {
          <span style="color: #b22222;">// </span><span style="color: #b22222;">we just switched to a new leader, but the new leader</span>
          <span style="color: #b22222;">// </span><span style="color: #b22222;">will not be included in the writer group.</span>
          prev_leader-&gt;next = <span style="color: #00006DE06DE0;">nullptr</span>;
        }
        <span style="color: #0000cd;">break</span>;
      }

      <span style="color: #0000cd;">if</span> (cur_leader-&gt;batch == <span style="color: #00006DE06DE0;">nullptr</span>) {
        cur_leader-&gt;next = w;
        cur_leader = w;
      }

      <span style="color: #0000cd;">if</span> (w != cur_leader) {
        <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::Append(cur_leader-&gt;batch, w-&gt;batch);
      }
    }
    group-&gt;last_writer = w;
  }
}
</pre>
</div>
</div>
