leveldb_writergroup.org
** 修改后的写入流程

1. 构造Writer，设置Writer的batch和callback，放入DBImpl::writers_中，然后wait()
2. writers_的队首取得写入权
3. BuildWriterGroup构建writer group
4. 从first leader开始，遍历writer group的所有batch group：
   - 如果leader有callback，则调用callback。若Status::OK，继续；否则跳转到4.4
   - 若leader的batch为nullptr，continue。
   - 将当前leader的batch写入WAL和MemTable。
   - 通知该batch group的所有writer已完成。
   - 继续下一个leader

#+begin_src cpp
  Status DBImpl::Write(const WriteOptions& options, WriteBatch* updates,
                       WriteCallback* callback) {
    Writer w(&mutex_);
    w.batch = updates;
    w.sync = options.sync;
    w.done = false;
    w.callback = callback;

    MutexLock l(&mutex_);
    writers_.push_back(&w);
    while (!w.done && &w != writers_.front()) {
      w.cv.Wait();
    }
    if (w.done) {
      return w.status;
    }

    // &w == writers_.front() is TRUE
    // May temporarily unlock and wait.
    Status status = MakeRoomForWrite(updates == nullptr);
    uint64_t last_sequence = versions_->LastSequence();
    Writer* last_writer = &w;
    if (status.ok() && updates != nullptr) {  // nullptr batch is for compactions
      WriterGroup writer_group;
      Writer* cur_leader;
      WriteBatch* write_batch;
      BuildWriterGroup(&writer_group);
      assert(writer_group.first_leader == &w);

      for (cur_leader = writer_group.first_leader; cur_leader != nullptr;
           cur_leader = cur_leader->next) {
        mutex_.Unlock();
        write_batch = cur_leader->batch;

        if (cur_leader->callback != nullptr &&
            !cur_leader->callback->Callback(this).ok()) {
          mutex_.Lock();
          goto NOTIFY;
        }

        if (write_batch == nullptr) {
          mutex_.Lock();
          goto NOTIFY;
        }

        WriteBatchInternal::SetSequence(write_batch, last_sequence + 1);
        last_sequence += WriteBatchInternal::Count(write_batch);
        {
          status = log_->AddRecord(WriteBatchInternal::Contents(write_batch));
          bool sync_error = false;
          if (status.ok() && options.sync) {
            // TODO: we may sync logfile many times within a sync WriteGroup
            status = logfile_->Sync();
            if (!status.ok()) {
              sync_error = true;
            }
          }
          if (status.ok()) {
            status = WriteBatchInternal::InsertInto(write_batch, mem_);
          }

          mutex_.Lock();
          if (sync_error) {
            // The state of the log file is indeterminate: the log record we
            // just added may or may not show up when the DB is re-opened.
            // So we force the DB into a mode where all future writes fail.
            RecordBackgroundError(status);
          }
        }
        if (write_batch == tmp_batch_) tmp_batch_->Clear();

        versions_->SetLastSequence(last_sequence);

      NOTIFY:
        while (true) {
          Writer* ready = writers_.front();
          writers_.pop_front();
          if (ready != cur_leader->next && ready != &w) {
            ready->status = status;
            ready->done = true;
            ready->cv.Signal();
          }
          if (ready == cur_leader->next || ready == last_writer) {
            break;
          }
        }
      }
    } else {
      assert(writers_.front() == &w);
      writers_.pop_front();
    }

    // Notify new head of write queue
    if (!writers_.empty()) {
      writers_.front()->cv.Signal();
    }

    return status;
  }
#+end_src

要注意的是在调用callback时，我们应该释放mutex，因为用户可能在callback
里查询数据库，但WriteCallback不允许用户再次在Callback中同步调用Write，否则会产生死锁。用户可以在Callback中另起一个线程去Write

** Example usage
#+begin_src cpp
  class CustomWriteCallback: public WriteCallback {
    public:
    CustomWriteCallback() = default;
    ~CustomWriteCallback() override = default;

    Status Callback(DB* db) override {
      std::string value;
      Status s = db->Get(ReadOption(), key, &value);
      if(s.ok() && value==expected) {
        return Status::OK();
      }
      return Status::IOError("not found");
    }

    bool AllowGrouping() const { return true; }

    std::string key;
    std::string expected;
  }

  CustomWriteCallback cb;
  WriteBatch wb;
  cb.key = "key";
  cb.expected = "val0";
  wb.Put("key", "val1");

  db->Write(WriteOption(), &wb, &cb);
#+end_src
