leveldb_writergroup.html

<div id="outline-container-org61574f1" class="outline-3">
<h3 id="org61574f1"><span class="section-number-3">4.1.</span> 修改后的写入流程</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>构造Writer，设置Writer的batch和callback，放入DBImpl::writers_中，然后wait()</li>
<li>writers_的队首取得写入权</li>
<li>BuildWriterGroup构建writer group</li>
<li>从first leader开始，遍历writer group的所有batch group：
<ul class="org-ul">
<li>如果leader有callback，则调用callback。若Status::OK，继续；否则跳转到4.4</li>
<li>若leader的batch为nullptr，continue。</li>
<li>将当前leader的batch写入WAL和MemTable。</li>
<li>通知该batch group的所有writer已完成。</li>
<li>继续下一个leader</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #228b22;">Status</span> <span style="color: #00006DE06DE0;">DBImpl</span>::<span style="color: #ff0000;">Write</span>(<span style="color: #0000cd;">const</span> <span style="color: #228b22;">WriteOptions</span>&amp; <span style="color: #a0522d;">options</span>, <span style="color: #228b22;">WriteBatch</span>* <span style="color: #a0522d;">updates</span>,
                     <span style="color: #228b22;">WriteCallback</span>* <span style="color: #a0522d;">callback</span>) {
  <span style="color: #228b22;">Writer</span> <span style="color: #a0522d;">w</span>(&amp;mutex_);
  w.batch = updates;
  w.sync = options.sync;
  w.done = <span style="color: #00006DE06DE0;">false</span>;
  w.callback = callback;

  <span style="color: #228b22;">MutexLock</span> <span style="color: #a0522d;">l</span>(&amp;mutex_);
  writers_.push_back(&amp;w);
  <span style="color: #0000cd;">while</span> (!w.done &amp;&amp; &amp;w != writers_.front()) {
    w.cv.Wait();
  }
  <span style="color: #0000cd;">if</span> (w.done) {
    <span style="color: #0000cd;">return</span> w.status;
  }

  <span style="color: #b22222;">// </span><span style="color: #b22222;">&amp;w == writers_.front() is TRUE</span>
  <span style="color: #b22222;">// </span><span style="color: #b22222;">May temporarily unlock and wait.</span>
  <span style="color: #228b22;">Status</span> <span style="color: #a0522d;">status</span> = MakeRoomForWrite(updates == <span style="color: #00006DE06DE0;">nullptr</span>);
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">last_sequence</span> = versions_-&gt;LastSequence();
  <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">last_writer</span> = &amp;w;
  <span style="color: #0000cd;">if</span> (status.ok() &amp;&amp; updates != <span style="color: #00006DE06DE0;">nullptr</span>) {  <span style="color: #b22222;">// </span><span style="color: #b22222;">nullptr batch is for compactions</span>
    <span style="color: #228b22;">WriterGroup</span> <span style="color: #a0522d;">writer_group</span>;
    <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">cur_leader</span>;
    <span style="color: #228b22;">WriteBatch</span>* <span style="color: #a0522d;">write_batch</span>;
    BuildWriterGroup(&amp;writer_group);
    assert(writer_group.first_leader == &amp;w);

    <span style="color: #0000cd;">for</span> (cur_leader = writer_group.first_leader; cur_leader != <span style="color: #00006DE06DE0;">nullptr</span>;
         cur_leader = cur_leader-&gt;next) {
      mutex_.Unlock();
      write_batch = cur_leader-&gt;batch;

      <span style="color: #0000cd;">if</span> (cur_leader-&gt;callback != <span style="color: #00006DE06DE0;">nullptr</span> &amp;&amp;
          !cur_leader-&gt;callback-&gt;Callback(<span style="color: #0000cd;">this</span>).ok()) {
        mutex_.Lock();
        <span style="color: #0000cd;">goto</span> <span style="color: #00006DE06DE0;">NOTIFY</span>;
      }

      <span style="color: #0000cd;">if</span> (write_batch == <span style="color: #00006DE06DE0;">nullptr</span>) {
        mutex_.Lock();
        <span style="color: #0000cd;">goto</span> <span style="color: #00006DE06DE0;">NOTIFY</span>;
      }

      <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::SetSequence(write_batch, last_sequence + 1);
      last_sequence += <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::Count(write_batch);
      {
        status = log_-&gt;AddRecord(<span style="color: #00006DE06DE0;">WriteBatchInternal</span>::Contents(write_batch));
        <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">sync_error</span> = <span style="color: #00006DE06DE0;">false</span>;
        <span style="color: #0000cd;">if</span> (status.ok() &amp;&amp; options.sync) {
          <span style="color: #b22222;">// </span><span style="color: #b22222;">TODO: we may sync logfile many times within a sync WriteGroup</span>
          status = logfile_-&gt;Sync();
          <span style="color: #0000cd;">if</span> (!status.ok()) {
            sync_error = <span style="color: #00006DE06DE0;">true</span>;
          }
        }
        <span style="color: #0000cd;">if</span> (status.ok()) {
          status = <span style="color: #00006DE06DE0;">WriteBatchInternal</span>::InsertInto(write_batch, mem_);
        }

        mutex_.Lock();
        <span style="color: #0000cd;">if</span> (sync_error) {
          <span style="color: #b22222;">// </span><span style="color: #b22222;">The state of the log file is indeterminate: the log record we</span>
          <span style="color: #b22222;">// </span><span style="color: #b22222;">just added may or may not show up when the DB is re-opened.</span>
          <span style="color: #b22222;">// </span><span style="color: #b22222;">So we force the DB into a mode where all future writes fail.</span>
          RecordBackgroundError(status);
        }
      }
      <span style="color: #0000cd;">if</span> (write_batch == tmp_batch_) tmp_batch_-&gt;Clear();

      versions_-&gt;SetLastSequence(last_sequence);

    <span style="color: #00006DE06DE0;">NOTIFY</span>:
      <span style="color: #0000cd;">while</span> (<span style="color: #00006DE06DE0;">true</span>) {
        <span style="color: #228b22;">Writer</span>* <span style="color: #a0522d;">ready</span> = writers_.front();
        writers_.pop_front();
        <span style="color: #0000cd;">if</span> (ready != cur_leader-&gt;next &amp;&amp; ready != &amp;w) {
          ready-&gt;status = status;
          ready-&gt;done = <span style="color: #00006DE06DE0;">true</span>;
          ready-&gt;cv.Signal();
        }
        <span style="color: #0000cd;">if</span> (ready == cur_leader-&gt;next || ready == last_writer) {
          <span style="color: #0000cd;">break</span>;
        }
      }
    }
  } <span style="color: #0000cd;">else</span> {
    assert(writers_.front() == &amp;w);
    writers_.pop_front();
  }

  <span style="color: #b22222;">// </span><span style="color: #b22222;">Notify new head of write queue</span>
  <span style="color: #0000cd;">if</span> (!writers_.empty()) {
    writers_.front()-&gt;cv.Signal();
  }

  <span style="color: #0000cd;">return</span> status;
}
</pre>
</div>

<p>
要注意的是在调用callback时，我们应该释放mutex，因为用户可能在callback
里查询数据库，但WriteCallback不允许用户再次在Callback中同步调用Write，否则会产生死锁。用户可以在Callback中另起一个线程去Write
</p>
</div>
</div>

<div id="outline-container-orgcc7f425" class="outline-3">
<h3 id="orgcc7f425"><span class="section-number-3">4.2.</span> Example usage</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000cd;">class</span> <span style="color: #228b22;">CustomWriteCallback</span>: <span style="color: #0000cd;">public</span> <span style="color: #228b22;">WriteCallback</span> {
  <span style="color: #0000cd;">public</span>:
  <span style="color: #ff0000;">CustomWriteCallback</span>() = <span style="color: #0000cd;">default</span>;
  ~<span style="color: #ff0000;">CustomWriteCallback</span>() <span style="color: #0000cd;">override</span> = <span style="color: #0000cd;">default</span>;

  <span style="color: #228b22;">Status</span> <span style="color: #ff0000;">Callback</span>(<span style="color: #228b22;">DB</span>* <span style="color: #a0522d;">db</span>) <span style="color: #0000cd;">override</span> {
    <span style="color: #00006DE06DE0;">std</span>::<span style="color: #228b22;">string</span> <span style="color: #a0522d;">value</span>;
    <span style="color: #228b22;">Status</span> <span style="color: #a0522d;">s</span> = db-&gt;Get(ReadOption(), key, &amp;value);
    <span style="color: #0000cd;">if</span>(s.ok() &amp;&amp; value==expected) {
      <span style="color: #0000cd;">return</span> <span style="color: #00006DE06DE0;">Status</span>::OK();
    }
    <span style="color: #0000cd;">return</span> <span style="color: #00006DE06DE0;">Status</span>::IOError(<span style="color: #8b008b;">"not found"</span>);
  }

  <span style="color: #228b22;">bool</span> <span style="color: #ff0000;">AllowGrouping</span>() <span style="color: #0000cd;">const</span> { <span style="color: #0000cd;">return</span> <span style="color: #00006DE06DE0;">true</span>; }

  <span style="color: #00006DE06DE0;">std</span>::<span style="color: #228b22;">string</span> <span style="color: #a0522d;">key</span>;
  <span style="color: #00006DE06DE0;">std</span>::<span style="color: #228b22;">string</span> <span style="color: #a0522d;">expected</span>;
}

<span style="color: #228b22;">CustomWriteCallback</span> <span style="color: #a0522d;">cb</span>;
<span style="color: #228b22;">WriteBatch</span> <span style="color: #a0522d;">wb</span>;
cb.key = <span style="color: #8b008b;">"key"</span>;
cb.expected = <span style="color: #8b008b;">"val0"</span>;
wb.Put(<span style="color: #8b008b;">"key"</span>, <span style="color: #8b008b;">"val1"</span>);

db-&gt;Write(WriteOption(), &amp;wb, &amp;cb);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-04-13 Thu 20:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
